MER.dbml
Table users {
  id BIGINT [pk]
  full_name VARCHAR(100)
  email VARCHAR(100)
  password VARCHAR(255)
  phone VARCHAR(20)
  profile_image_url VARCHAR(500)
  created_at DATETIME2
  updated_at DATETIME2
}

Table roles {
  id BIGINT [pk]
  name VARCHAR(100)
  description VARCHAR(255)
}

Table user_roles {
  user_id BIGINT [ref: > users.id]
  role_id BIGINT [ref: > roles.id]
}

Table books {
  id BIGINT [pk]
  title VARCHAR(100)
  description VARCHAR(MAX)
  isbn VARCHAR(20)
  cover_url VARCHAR(500)
  file_url VARCHAR(500)
  published_year INT
  available BIT
  created_at DATETIME2
  updated_at DATETIME2
}

Table authors {
  id BIGINT [pk]
  full_name VARCHAR(100)
  biography VARCHAR(MAX)
  birth_date DATE
  created_at DATETIME2
}

Table categories {
  id BIGINT [pk]
  name VARCHAR(100)
  description VARCHAR(MAX)
  created_at DATETIME2
}

Table book_authors {
  book_id BIGINT [ref: > books.id]
  author_id BIGINT [ref: > authors.id]
}

Table book_categories {
  book_id BIGINT [ref: > books.id]
  category_id BIGINT [ref: > categories.id]
}

Table loans {
  id BIGINT [pk]
  user_id BIGINT [ref: > users.id]
  book_id BIGINT [ref: > books.id]
  loan_date DATETIME2
  return_date DATETIME2
  status VARCHAR(50)
  created_at DATETIME2
}

Table reviews {
  id BIGINT [pk]
  user_id BIGINT [ref: > users.id]
  book_id BIGINT [ref: > books.id]
  rating INT
  comment VARCHAR(MAX)
  created_at DATETIME2
}
